
generator
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
z (InputLayer)               (None, 28, 28, 1)         0         
_________________________________________________________________
g_encoder_h0_conv (Conv2D)   (None, 14, 14, 32)        832       
_________________________________________________________________
batch_normalization_4 (Batch (None, 14, 14, 32)        128       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 14, 14, 32)        0         
_________________________________________________________________
g_encoder_h1_conv (Conv2D)   (None, 7, 7, 64)          51264     
_________________________________________________________________
batch_normalization_5 (Batch (None, 7, 7, 64)          256       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 7, 7, 64)          0         
_________________________________________________________________
g_encoder_h2_conv (Conv2D)   (None, 4, 4, 128)         204928    
_________________________________________________________________
batch_normalization_6 (Batch (None, 4, 4, 128)         512       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 4, 4, 16)          51216     
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 16)          6416      
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 32)        4640      
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 28, 28, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 1)         801       
=================================================================
Total params: 320,993
Trainable params: 320,545
Non-trainable params: 448
_________________________________________________________________

discriminator
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
d_input (InputLayer)         (None, 28, 28, 1)         0         
_________________________________________________________________
d_h0_conv (Conv2D)           (None, 14, 14, 16)        416       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 14, 14, 16)        0         
_________________________________________________________________
d_h1_conv (Conv2D)           (None, 7, 7, 32)          12832     
_________________________________________________________________
batch_normalization_1 (Batch (None, 7, 7, 32)          128       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 7, 7, 32)          0         
_________________________________________________________________
d_h2_conv (Conv2D)           (None, 4, 4, 64)          51264     
_________________________________________________________________
batch_normalization_2 (Batch (None, 4, 4, 64)          256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 4, 4, 64)          0         
_________________________________________________________________
d_h3_conv (Conv2D)           (None, 2, 2, 128)         204928    
_________________________________________________________________
batch_normalization_3 (Batch (None, 2, 2, 128)         512       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 2, 2, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0         
_________________________________________________________________
d_h3_lin (Dense)             (None, 1)                 513       
=================================================================
Total params: 541,250
Trainable params: 270,401
Non-trainable params: 270,849
_________________________________________________________________

adversarial_model
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 28, 28, 1)         0         
_________________________________________________________________
R (Model)                    (None, 28, 28, 1)         320993    
_________________________________________________________________
D (Model)                    (None, 1)                 270849    
=================================================================
Total params: 591,842
Trainable params: 320,545
Non-trainable params: 271,297
_________________________________________________________________
self.data: 6742
cluster_show: (6742, 28, 28)
cluster_data: (6742, 784)
cluster_points: 6742
incenter: 3
centroids: 3
centroids: [[0. 0. 0. ... 0. 0. 0.]
 [0. 0. 0. ... 0. 0. 0.]
 [0. 0. 0. ... 0. 0. 0.]]
idx: 6742 [[0. 0. 0. ... 0. 0. 0.]
 [0. 0. 0. ... 0. 0. 0.]
 [0. 0. 0. ... 0. 0. 0.]] 94055.15701552325
labels: 2.0
